/*************************************************************************
	> File Name: coin.cpp
	> Author: 
	> Mail: 
	> Created Time: 2019年06月15日 星期六 13时19分48秒
    > 使用贪心来计算支付A元，至少需要多硬币
 ************************************************************************/

#include<iostream>
using namespace std;

// 纸币的金额
const int V[6] = {1,5,10,50,100,500};
// 对应的每种纸币的数量
int C[6];
// 需要支付的金额
int A;

void solve01(){
    int ans = 0;

    for ( int i = 5; i >= 0; --i ){
        int t = min(A/V[i], C[i]);
        A -= t * V[i];
        ans += t;
    }

    printf("%d\n", ans);
}

int main()
{
    // 由于硬币的数量组合不对，可能会导致
    // 无法得到正好正确的结果，因此，参数都事先设置好
    C[0] = 3;
    C[1] = 2;
    C[2] = 1;
    C[3] = 3;
    C[4] = 0;
    C[5] = 2;
    A = 683;
    solve01();
    return 0;
}
